[
   {
      "id": 1,
      "title": "The Best Cleaning Products For Degreasing Your Stovetop",
      "img": "https://assets.epicurious.com/photos/5ed0074dc6d8a5f84c76be1f/16:9/w_1920,c_limit/STOVETOP_0614_BA_PREP_05_VOG_final.jpg",
      "category": "SHOPPING",
      "author": "LAUREN VIERA",
      "date": "May 28, 2020",
      "innerSubTitle": "Make your stovetop fresh and ready to welcome you back for another night of cooking dinner. ",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nEspecially when you’re so busy cooking all the time, it’s easy to let dishes stack up. Or forget to deodorize the fridge. Or put off oven cleaning. But there’s one area of your kitchen that you should really try to wipe it down on the regular: the stovetop.\nThink of your stovetop like your bed. Chances are, you use it most nights. And even if you’re the type who isn’t bothered by the sight of an unmade bed or a sauce-splattered stovetop during the day, it’s when you crawl into bed at night or go to cook but find that you're setting last night's wayward chickpea on fire that it starts to bother you. You want this space to be fresh and ready, eager to welcome you back.\nEnter the stovetop cleaner. Beyond routinely erasing the mess left by those three-pot meals and splatter-prone red sauces, the best of them can tackle residue from last weekend’s Belgian waffles, and then some. To test some of the most popular stovetop cleaners, I purposefully neglected my porcelain-enamel range for a week (it was gross), then divvied it into a grid for side-by-side product comparisons. Here’s how it went."
   },
   {
      "id": 2,
      "title": "How to Clean Your Oven, Because It’s Not Really Going to Clean Itself",
      "img": "https://assets.epicurious.com/photos/5ac54f383154144b9859859c/16:9/w_1920,c_limit/chicken-in-oven-tray-underneath-3305.jpg",
      "category": "SHOPPING",
      "author": "LAUREN VIERA",
      "date": "May 28, 2020",
      "innerSubTitle": "We tried a bunch of top rated oven-cleaning products. Here are the ones that worked best. ",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nConfession: I may, at first, seem like an unlikely candidate to tell you how to clean your oven. I never clean my oven. Technically, it gets an annual cleaning just after its biggest day of the year: Thanksgiving. The following morning, I make my way to the kitchen to survey the damage, press the self-cleaning button, chill out for the four-plus hours it takes to run its course, then sweep clean whatever burnt-off bits come loose in the process. No elbow grease, no nothing. So sue me.\nIf you clean your own oven with actual products and even the slightest bit of wrist strength, then you’ve already got me beat. Perhaps your oven gets a good cleaning a couple of times a year, which is plenty: most experts recommend doing it seasonally. But now, of course, when we’re cooking more than ever, even the most laid-back oven cleaners among us are beginning to notice increased grease and grime build-up. We may even feel like we can’t safely start cooking again until we deal with yesterday’s dripped bacon grease or pie filling. Since we’re about halfway between last Thanksgiving and next, this is as good a time as any to do a true deep-cleaning. After researching the best oven cleaning products available, I divvied up my oven floor using painter’s tape and cleaned each little box with a separate top-rated cleaner. If you're wondering how to clean your oven using the best products, here’s what worked best, what didn’t work at all, and everything in between."
   },
   {
      "id": 3,
      "title": "The Best Robot Vacuum for Cleaning Your Kitchen Messes (And Your Regular Messes, Too)",
      "img": "https://assets.epicurious.com/photos/5ee138c3c0f6cca21c0e6cb3/16:9/w_1920,c_limit/EPI-ROBOT-VACUUM_ILLO-V3.png",
      "category": "SHOPPING",
      "author": "EMILY JOHNSON",
      "date": "July 23, 2020",
      "innerSubTitle": "We tested 9 top-rated robot vacuums to find the ones that would aid you in your kitchen and dining room cleaning needs. Read on to find the ones that suck up spilled coffee grounds (and spilled flour, and all those sprinkles) best.",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nIn the search for the best robot vacuum, as in life, it's important to manage your expectations.\nIt's only natural to look for a silver bullet: You've been housebound, cleaning up after yourself and your loved ones near constantly, for months now. You've become astounded at the sheer human capacity to create mess; you've felt resentment toward your partner, your less-adorable-than-ever child, even your golden retriever. You're concerned about the robot takeover Andrew Yang is always warning us about, but enough is enough. Let the robots have the vacuuming, you’ll take your $1,000 a month and an extra hour a night for prestige television.\nSadly, even the best robot vacuum will not clean your house for you. Robot vacuums are good for picking up a top layer of dirt, for daily maintenance of keeping the dog hair and spilled coffee grounds at bay, but you'll still need to own a regular vacuum to remove the heavy duty dirt.\nThat said, I'd argue that everyone should own a robot vacuum—and especially right now. Robot vacuums are an endless source of joy. They're delightfully dumb. They bump into things and move in odd patterns. They never quite pick up as much as you want them to. And yet, when one is home all day and desperate for entertainment, the robot vacuum comes through. Watching the sweet little guy whir over your floors, picking up dirt and asking for nothing from you in return, is gratifying. And in Covid times, it even qualifies as fun.\nTo bring that kind of magic back into your life, we tested 9 top-rated models to find the best robot vacuums. Because we're a home cooking site, we paid particular attention to the robo vacs that would aid you in your kitchen and dining room cleaning needs. Read on to find the ones that suck up spilled coffee grounds (and spilled flour, and all those sprinkles) best."
   },
   {
      "id": 4,
      "title": "The Best Pantry Storage Containers for Flour, Sugar, and Beyond",
      "img": "https://assets.epicurious.com/photos/61b926b3aab868c36c9a5305/16:9/w_1920,c_limit/BestPantryStorageContainers_HERO_120621_24393_V1_final.jpg",
      "category": "SHOPPING",
      "author": "JARRETT MELENDEZ",
      "date": "December 27, 2021",
      "innerSubTitle": "Keep your dry goods dry (and safe from pests) with the storage containers commercial kitchens swear by.",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nThere’s little on this earth that gives me as much calm joy as a well-organized pantry. Even before I worked in commercial kitchens, I loved keeping my pantry stocked and organized so that I could take on cooking and baking projects without worrying whether I had all the right ingredients, or where on earth that container of spelt flour was. Not only does keeping your pantry organized make life easier, but it helps maximize that precious storage space, and helps keep things cleaner. Nobody likes a pantry full of open bags of flour and sugar—that’s just asking for spills to happen!\nIf you’re the type of person that keeps several kinds of flour on hand for big baking projects, or you keep bulk amounts of beans and lentils and rice around all the time, you should have good storage containers that keep all of your dry goods fresh and, well, dry!\nI’ve used the same commercial kitchen storage containers for years, and swear by them. But I wanted to truly put a variety of brands up against each other to see if regular containers marketed for home use could unseat my preferred pantry storage system. I had a good long look around and grabbed some storage systems from trusted and best-selling brands, along with some recommendations from fellow food pros. Here’s how they did."
   }
]
