[
   {
      "id": 12,
      "title": "The Epicurious Guide to Olive Oil",
      "img": "https://assets.epicurious.com/photos/5cbf3ad23828923f5d29360d/16:9/w_1920%2Cc_limit/Katie-Parla's-Favorite-Italian-Anchovies-hero-18042019.jpg",
      "category": "OLIVE OIL",
      "author": "THE EDITORS OF EPICURIOUS",
      "date": "October 26, 2019",
      "innerSubTitle": "Okay, they’re not actually baby cabbages. But they are adorable and delicious. ",
      "description": "We all know the story, more or less: the rise and fall and rise again of olive oil.\nIt emerged victorious from the low-fat era as the cooking oil of choice in American kitchens. It was Mediterranean. It was healthy. It was, as oils go, glam. Then, like many a glamster, olive oil's reputation could only fly so high before it suffered at the hands of the internet. Starting in around 2012 the general click force came after olive oil for being fake. A billion well-intentioned scare articles emerged about how many so-called olive oils were cut with inferior oils like canola—and they weren't coming from they said they were, either.\nNow, we've mostly forgiven olive oil its transgressions, even while we've had flings and fallings out with other oils. It seems we've recognized nuance, in olive oil flavor and sourcing and terroir.\nWhat's more? It's the golden age of fat—fat will cure your many ailments and give you the wisdom of an ancient prophet and the skin of a tiny baby. And we've seen new frontiers for olive oil: There's a generation of Instagram model olive oils inundating our feeds. There are olive oils you can subscribe to as you once subscribed to those old print magazines. There are new and unlikely territories popping up as promising olive oil districts.\nSo, it seems like it might be time to talk about olive oil again.\nBecause it's still confusing to shop for, we've gathered here all our tips for finding the best olive oil. We baked with it and fried with it and cooked chicken in it for six hours. And, we explored the next gen of scary olive oil situations, digging into how climate change has begun to affect the farms that grow everyone's favorite golden fat juice. In short, we're coming at you with the Epicurious guide to everything you need to know about olive oil right now, in 2019. Check it out below."
   },
   {
      "id": 13,
      "title": "The Best Oil to Cook With Isn’t Olive or Vegetable—It’s Both",
      "img": "https://assets.epicurious.com/photos/5d978c373b5f6c00084ea375/16:9/w_1920,c_limit/AmielOil_HERO_100219_5658.jpg",
      "category": "OLIVE OIL",
      "author": " AMIEL STANEK",
      "date": "October 21, 2019",
      "innerSubTitle": "When you want that Big Olive Oil Energy but don't want to go broke, grab a squeeze bottle and make a blend.",
      "description": "At one of the first restaurants where I was a line-cook, we had three different types of oil on heavy rotation. The first was a standard, no-fuss vegetable oil used primarily for filling the deep fryer. The second was a fancy-seeming extra-virgin olive oil—a “finishing oil”—which was used judiciously, primarily by the chef who drizzled a bit of it onto plates just before they went out to the dining room. The third was a mysteriously-named substance in a yellow jug called “blended oil” which, as its name suggested, was an economical mix of canola oil and (an apparently nominal amount of) extra-virgin olive oil. Thinking back, it probably tasted pretty lousy, but it was our go-to, used with abandon for pan frying, vinaigrettes, aioli, and just about everything else you could think of.\nI never encountered that strange blended oil after I left that job, but I started to think about it again a few years back when, after doing some research, I finally got serious about stocking high-quality extra-virgin olive oil exclusively. I quickly ran into two problems. The first was that my favorite brands were expensive—a small-ish bottle could easily add twenty dollars to my grocery bill—and disappeared alarmingly fast.\nThe second problem was, counterintuitively, how good these oils tasted. I started to find that the same peppery, green-grassy flavors that I loved in these extra-virgin olive oils could easily overpower simple vinaigrettes and overwhelm delicate sautés; I simultaneously had too much flavor and not enough of it."
   },
   {
      "id": 14,
      "title": "Olive Oil Is Better for Cake Than Butter. There, I Said It.",
      "img": "https://assets.epicurious.com/photos/5da874a37ecb61000833dc57/16:9/w_1920,c_limit/OliveOilCake_PROCESS_IG_101619_6123.jpg",
      "category": "OLIVE OIL",
      "author": "DAVID TAMARKIN",
      "date": "October 22, 2019",
      "innerSubTitle": "When it comes to baking fats, butter is great. But it's olive oil that really takes the…you know…",
      "description": "To pit butter versus olive oil is something only an idiot would do. Butter is classical, olive oil is jazz, and anybody who thinks that one is better than the other is not somebody I want to hit the town with.\nSo why I have spent the better part of a month haunted by the conviction that olive oil is superior for cakes?\nIt’s probably just a phase I’m going through. But while I’m here, let's flesh this argument out. First there's the flavor. Where butter is sweet, milky, and often in the background of a cake’s flavor, olive oil is earthy, grassy, and bold. An olive oil cake will always have a savory edge, sometimes even a backnote of bitterness, that a butter cake will lack.\nNext: texture. Olive oil cakes are the world’s moistest, and unlike their butter brothers, which are constantly at risk of drying out, they stay moist for days. Which brings us to another benefit of olive oil cakes: longevity. “I think olive oil cakes kind of get better with age,” says Elizabeth Quijada, the pastry chef at Abraço, a New York City coffee shop that is known for their olive oil cake. “It’s at its prime at three or four days.”\nIf I’m being honest, though, none of the superiorities described above are what has put me on Team Olive Oil. Instead, there’s a fourth reason, especially for a person like me who tries to keep himself in cake at all times. I’m talking about the speed and ease in which olive oil cakes come together."
   },
   {
      "id": 15,
      "title": "What Olive Oils Do Chefs Really Use?",
      "img": "https://assets.epicurious.com/photos/5daf28315f201e0009aa22f2/16:9/w_1920,c_limit/ChefOil_HERO_101619_6324.jpg",
      "category": "OLIVE OIL",
      "author": "ALICIA KENNEDY",
      "date": "October 22, 2019",
      "innerSubTitle": "Shopping for olive oil is confusing, so we asked the pros about their favorites. Here's what chefs and food experts turn to as their go-to fat. ",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nWhile olive oil is a kitchen staple—something home cooks and professionals alike reach for day in and day out as a go-to fat—it's still remarkably confusing to shop for. There has, of course, been quite a bit of controversy surrounding its harvest and authenticity. At the same time, there’s increased awareness of the nuance in olive oil flavor and terroir—thus a crowded, confusing field becomes even more unwieldy to navigate. In cases like these, it’s always best to go to the experts: chefs themselves.\nStill, even chefs have a variety of preferences—and place varying levels of importance on the specific brand—when it comes to olive oil. To some, like Amanda Cohen, the chef at New York City’s Dirt Candy, there’s nothing precious about olive oil. Even though she says she’s up to her elbows in it all day long, using it in salad dressings, as a finisher, and as her go-to cooking oil, she has no specific favorite. “I use whatever my supplier brings me, in part because I like to try new oils all the time, but in part because I’m lazy,” she says. “To be honest, they all cook up pretty much the same, with really only minor variations.”\nOn the other hand, Samin Nosrat, author and host of Netflix's Salt Fat Acid Heat likes to remind people that it’s important to be conscientious; to her it’s not a matter of cooking with cheap oil and finishing with something a bit more expensive, because the overall quality will always make a difference. “Whatever oil you cook with becomes to foundation of the food, 'she says, “So I want my daily oil to be good oil.'\nKeeping in mind that tastes are specific and personal, we asked five chefs about their go-to olive oils hoping to make our own shopping a little easier."
   }
]
