[
   {
      "id": 1,
      "title": "31 Ways to Make Crispy, Crunchy, Caramelized Brussels Sprouts",
      "img": "https://assets.epicurious.com/photos/5dd2ee4256c4b30009ff24be/16:9/w_1920%2Cc_limit/Brussels_sprouts_with_pistachios_and_lime_recipe_BA_111819.jpg",
      "category": "Brussels Sprout",
      "author": "The editor of epicurious",
      "date": "11.15.22",
      "innerSubTitle": "Okay, they’re not actually baby cabbages. But they are adorable and delicious. ",
      "description": "Sure, brussels sprouts had some dark, mushy, overcooked days. But in recent years we've learned how fantastic they can be if you have the right brussels sprouts recipes. We love these little guys shaved in a slaw or glazed until glistening or roasted, cut side down, until chip-like and crispy. Here are a few of our favorite ways to serve brussels sprouts now, whether you're putting a weeknight dinner on the table or trying to bring an all-star side to Thanksgiving."
   },
   {
      "id": 2,
      "title": "7 Great Substitutes for Cornstarch",
      "img": "https://assets.epicurious.com/photos/627ac14e3e7652f84d17a49a/16:9/w_1920,c_limit/cornstarch-macro-051022.jpg",
      "category": "KITCHEN INTELLIGENCE",
      "author": "CAMRYN RABIDEAU",
      "date": "11.12.22",
      "innerSubTitle": "Mid-recipe? Don’t fret. You probably have a cornstarch substitute somewhere in your pantry.",
      "description": "Next time you’re in the middle of making dinner and suddenly realize you’re out of cornstarch, don’t panic. Cornstarch substitutes abound—and there’s a good chance one (or more) of them is already in your pantry. But first, a brief lesson on what cornstarch is and what it does: Cornstarch is the powdered endosperm of corn kernels. (In the UK, cornstarch is called cornflour; in the States, “corn flour” generally refers to finely milled cornmeal, i.e., whole ground corn kernels.) The fine white powder is frequently used for thickening sauces, stews, and custards. It’s a staple in stir-fry recipes, in which it’s used to produce a glossy coating, but it can also be used in cookies and cakes to create a light, crumbly texture, and in fried foods to enhance their crisp exterior.Some sources cite glucomannan, ground flaxseeds, or guar gum as substitutes for cornstarch, but these don’t deliver the same texture and may impart unwanted flavors. Still, there are plenty of other ready ingredients you can swap in for cornstarch to achieve similar results—the best one to choose depends on what type of recipe you’re making."
   },
   {
      "id": 3,
      "title": "37 Pumpkin Purée Recipes That Aren’t Just Another Pie",
      "img": "https://assets.epicurious.com/photos/5b981abb8127422e2d2f45cd/16:9/w_1920%2Cc_limit/Pumpkin-and-Cookie-Butter-Sheet-Cake-With-Toasted-Meringue-recipe-05092018.jpg",
      "category": "RECIPE ROUNDUP",
      "author": "THE EDITORS OF EPICURIOUS",
      "date": "11.09.22",
      "innerSubTitle": "Listen, we love pumpkin pie, but there are so many more places that can of pumpkin purée can go.",
      "description": "If you’re looking for the best pumpkin pie to bake, you’re in the wrong place. (Head over here!) Still with us? Great! Because we’ve compiled our favorite pumpkin purée recipes here, including fall cakes, perfectly spiced doughnuts, soothing soups, easy quick breads, and creamy pastas. These recipes give you options for using up the dregs of a can of leftover pumpkin purée—as well as ideas for what to do with any additional cans taking up precious cabinet space. But be forewarned, once you start scrolling you might just realize you don’t have enough canned pumpkin purée to make every recipe that catches your eye. Need to stock up? Find our favorite brand right over here."
   },
   {
      "id": 4,
      "title": "71 Pasta Recipes to Cook If Spaghetti Is Your Love Language",
      "img": "https://assets.epicurious.com/photos/5ae362adf8542520401e0d86/16:9/w_1920%2Cc_limit/Cauliflower-Carbonara-03012018.jpg",
      "category": "RECIPE ROUNDUP",
      "author": "JULIA PRICE BARON AND THE EDITORS OF EPICURIOUS",
      "date": "11.03.22",
      "innerSubTitle": "Or bucatini. Or linguine. Or orzo. Or… you get the picture.",
      "description": "If there’s one category of food I can fully get behind, it’s pasta—and these pasta recipes don’t disappoint. Although my dinner party default dish has long been lasagna and I get weak in the knees for a classic basil pesto, the truth is I’ll take any kind of pasta any day (and any meal) of the week. Between our easy stuffed shells, homemade gluten-free fresh pasta, creamy vegan ziti, and chorizo-sauced spaghetti, I’m convinced that the following collection of flavorful and easy recipes holds unifying, world peace pastability. (I just couldn’t resist.)"
   },
   {
      "id": 5,
      "title": "29 Recipes That Turn a Rotisserie Chicken Into Dinner",
      "img": "https://assets.epicurious.com/photos/5a7894d5c6aea21096d5582f/16:9/w_1920%2Cc_limit/Filipino-Cure-for-the-Common-Cold-31012018.jpg",
      "category": "RECIPE ROUNDUP",
      "author": "THE EDITORS OF EPICURIOUS",
      "date": "10.19.22",
      "innerSubTitle": "You can eat it hot, you can eat it cold. But you can also make something new (and delicious!) out of that store-bought rotisserie chicken.",
      "description": "Pick up a rotisserie chicken and dinner is easy. But we don’t just mean cutting up that bird to eat unadorned. These rotisserie chicken recipes help you transform cooked chicken into a wide variety of flavorful meals without much prep. Shredded chicken can add protein and heft to soups, salads, pasta bakes, and more, and there are lots of ideas below for using up the last bits of a store-bought rotisserie chicken—or a whole bird, which probably means you want to pick up two in the first place. Scroll down for weeknight dinner ideas and no-fuss dinner party inspiration."
   },
   {
      "id": 6,
      "title": "The Best Crushed Red Pepper Flakes Are DIY",
      "img": "https://assets.epicurious.com/photos/632e0b863d8214ad950281ec/16:9/w_1920,c_limit/ChiliFlakes_HERO_092222_40160.jpg",
      "category": "CHILE",
      "author": "MATTHEW TRUEHERZ",
      "date": "10.18.22",
      "innerSubTitle": "Making your own means fresh, on-demand flakes that are perfect for whatever you have cooking.",
      "description": "If salt and pepper are the two busiest members of the spice cabinet, crushed red pepper flakes are surely third. And like salt and pepper, it’s easy to take them for granted—to presume they are an unchanging, perpetually stable seasoning that makes whatever you’re eating a bit more spicy.Red pepper flakes, a.k.a. crushed red pepper, and in some circles, chile flakes (the ones with the trademark seeds left in the mix) are all, ostensibly, the same thing. It’s easy enough to take them at face value, as an ingredient that generically spices up pizza, pasta, or sautéed greens.But these ubiquitous flecks present an opportunity for so much more. Aside from adding a kick to your favorite dishes, both in the pan and on the plate, chiles can bring deeply nuanced fruity notes and a range of different characters of heat, based on which type you’re using. There are milder, sweeter chiles that you can sprinkle liberally over hummus and into salad dressing or a pot of stewing lentils. And there are fiery chiles that can add a hard edge to laabs, curries, and anything alla diavola."
   },
   {
      "id": 7,
      "title": "23 Acorn Squash Recipes We’re Squirreling Away for Fall and Winter",
      "img": "https://assets.epicurious.com/photos/5ba010d0fe44ba546264204b/16:9/w_1920%2Cc_limit/Sheet-Pan-Roasted-Squash-and-Feta-Salad-13092018.jpg",
      "category": "RECIPE ROUNDUP",
      "author": "MEREDITH STETTNER AND THE EDITORS OF EPICURIOUS",
      "date": "10.07.22",
      "innerSubTitle": "Our best recipes for acorn squash include slow-roasted vegetable salads, quick weeknight dinner ideas, and a creamy custard pie.",
      "description": "Acorn squash is an adaptable ingredient, equally at home in a weekday salad or dinner party–worthy entrée. Our favorite acorn squash recipes highlight that versatility, proving that autumnal cooking doesn’t have to involve sugared cranberries, brown butter, or pumpkin spice to feel thoroughly seasonal—although using any of those ingredients sure wouldn’t hurt. Want something rich and warming that could double as dessert? Cook acorn squash halves with maple syrup until rich and buttery, à la Ina Garten. Or, if you crave a wholesome autumnal supper, try acorn squash stuffed with wild rice, kale, and other hearty fall fare. Whether you’re looking for a side dish for an upcoming holiday, an easy weeknight supper, or a seasonal dinner party main, there’s an acorn squash recipe to fit the bill below."
   },
   {
      "id": 8,
      "title": "The Best Substitutes for Cake Flour and Self-Rising Flour",
      "img": "https://assets.epicurious.com/photos/55c0c7d7ebc27eda122cf9a1/16:9/w_1920,c_limit/EP_07282015_dumpcakes_cakemix_recipeimage.jpg",
      "category": "BAKING",
      "author": "KELLY VAUGHAN AND SHEELA PRAKASH",
      "date": "10.14.22",
      "innerSubTitle": "Don’t skip a recipe just because it calls for special flour. All you need is all-purpose flour and some good old-fashioned ingenuity.",
      "description": "All-purpose flour is a pantry essential, but with a little tweaking, it can also serve as a substitute for cake flour, self-rising flour, and other specialty flours. While most home bakers rely on all-purpose flour for baking tender chocolate chip cookies and making Sunday morning pancakes, recipes that use cake flour and self-rising flour are less common. So unless you bake a lot, you might not have cake flour and self-rising flour ready in your pantry. Rather than run into town to pick up a bag at the last minute, you can substitute all-purpose flour (a.k.a. AP flour) for these varieties at home, using a few additional ingredients that you likely already have on hand. Yup, we just saved you a trip to the grocery store, all in the name of a moist, tender slice of chocolate cake (win-win)."
   },
   {
      "id": 9,
      "title": "23 Acorn Squash Recipes We’re Squirreling Away for Fall and Winter",
      "img": "https://assets.epicurious.com/photos/5ba010d0fe44ba546264204b/16:9/w_1920%2Cc_limit/Sheet-Pan-Roasted-Squash-and-Feta-Salad-13092018.jpg",
      "category": "RECIPE ROUNDUP",
      "author": "MEREDITH STETTNER AND THE EDITORS OF EPICURIOUS",
      "date": "10.07.22",
      "innerSubTitle": "Our best recipes for acorn squash include slow-roasted vegetable salads, quick weeknight dinner ideas, and a creamy custard pie.",
      "description": "Acorn squash is an adaptable ingredient, equally at home in a weekday salad or dinner party–worthy entrée. Our favorite acorn squash recipes highlight that versatility, proving that autumnal cooking doesn’t have to involve sugared cranberries, brown butter, or pumpkin spice to feel thoroughly seasonal—although using any of those ingredients sure wouldn’t hurt.\nWant something rich and warming that could double as dessert? Cook acorn squash halves with maple syrup until rich and buttery, à la Ina Garten. Or, if you crave a wholesome autumnal supper, try acorn squash stuffed with wild rice, kale, and other hearty fall fare.\nWhether you’re looking for a side dish for an upcoming holiday, an easy weeknight supper, or a seasonal dinner party main, there’s an acorn squash recipe to fit the bill below."
   },
   {
      "id": 10,
      "title": "37 Spinach Recipes That’ll Make All Your Other Veggies Green With Envy",
      "img": "https://assets.epicurious.com/photos/620fc40be02a52d109bfd087/16:9/w_1920%2Cc_limit/Gozleme_RECIPE_021622_28809.jpg",
      "category": "RECIPE ROUNDUP",
      "author": "MEREDITH STETTNER AND THE EDITORS OF EPICURIOUS",
      "date": "09.29.22",
      "innerSubTitle": "The nutrient-dense green is packed with calcium, potassium, vitamin C, and dietary fiber. It’s also extremely delicious.",
      "description": "This bounty of great spinach recipes should come in handy as the seasons change: A butternut squash and creamed spinach gratin delivers autumnal elegance, while spinach-and-sausage lasagna promises to warm you up in winter. When berries arrive at your local farmers market, toss them with fresh spinach and kefir vinaigrette in what may just be the world’s most perfect summer salad. And a simple sautéed spinach recipe makes for an easy and quick side dish to serve year-round. The versatile vegetable is a team player that’s equally at home in crisp salads, creamy dips, fresh pastas, and dumpling doughs. Whether you’re working with mature or baby spinach leaves, you can create all manner of meals from these leafy greens. No matter your craving, our favorite recipes for raw and cooked spinach have you covered."
   },
   {
      "id": 11,
      "title": "Who Invented Mac and Cheese? This American Favorite Has Ancient Roman Roots",
      "img": "https://assets.epicurious.com/photos/630ce464d3f76b9158811983/16:9/w_1920,c_limit/OurFavoriteMacaroniCheese_HERO_082522_38932.jpg",
      "category": "HISTORY",
      "author": "KARIMA MOYER-NOCCHI AND ADRIAN MILLER",
      "date": "09.27.22",
      "innerSubTitle": "A look at the historical fallacies, truths, and wishful thinking about the queen of comfort foods.",
      "description": "You’re making up a macaroni and cheese casserole for the neighborhood potluck. As you stir, the plump elbows surrender to the thick, creamy orange cheese sauce. The voluptuous, squishy sound of walking barefoot through mud promises success. A top layer of grated cheese, browned to a golden crust, will add the final irresistible allure to this quintessentially American dish. But how did a combination of cheese and pasta—two European cultural exports—become one of America’s best-known staples? \n The most famous version of the story goes like this: Thomas Jefferson brought an enslaved James Hemings to France to study culinary arts. Jefferson not only financed the lavish crash course in gastronomy but smuggled a pasta machine back from Naples so that Hemings could introduce macaroni and cheese to the elite families of the American South. Often, Hemings is left out of the story completely and Jefferson alone is the protagonist. A Budweiser ad from 1948 shows an illustration of Jefferson himself, serving plates of freshly made pasta to fellow forefathers. But that tidy origin story is just an example of a gastromyth—a food-related tall tale that snowballed as it’s been told to new generations. When it comes to macaroni and cheese history, we’ve got a lot more unpacking to do."
   },
   {
      "id": 12,
      "title": "The Epicurious Guide to Olive Oil",
      "img": "https://assets.epicurious.com/photos/5cbf3ad23828923f5d29360d/16:9/w_1920%2Cc_limit/Katie-Parla's-Favorite-Italian-Anchovies-hero-18042019.jpg",
      "category": "OLIVE OIL",
      "author": "THE EDITORS OF EPICURIOUS",
      "date": "October 26, 2019",
      "innerSubTitle": "Okay, they’re not actually baby cabbages. But they are adorable and delicious. ",
      "description": "We all know the story, more or less: the rise and fall and rise again of olive oil.\nIt emerged victorious from the low-fat era as the cooking oil of choice in American kitchens. It was Mediterranean. It was healthy. It was, as oils go, glam. Then, like many a glamster, olive oil's reputation could only fly so high before it suffered at the hands of the internet. Starting in around 2012 the general click force came after olive oil for being fake. A billion well-intentioned scare articles emerged about how many so-called olive oils were cut with inferior oils like canola—and they weren't coming from they said they were, either.\nNow, we've mostly forgiven olive oil its transgressions, even while we've had flings and fallings out with other oils. It seems we've recognized nuance, in olive oil flavor and sourcing and terroir.\nWhat's more? It's the golden age of fat—fat will cure your many ailments and give you the wisdom of an ancient prophet and the skin of a tiny baby. And we've seen new frontiers for olive oil: There's a generation of Instagram model olive oils inundating our feeds. There are olive oils you can subscribe to as you once subscribed to those old print magazines. There are new and unlikely territories popping up as promising olive oil districts.\nSo, it seems like it might be time to talk about olive oil again.\nBecause it's still confusing to shop for, we've gathered here all our tips for finding the best olive oil. We baked with it and fried with it and cooked chicken in it for six hours. And, we explored the next gen of scary olive oil situations, digging into how climate change has begun to affect the farms that grow everyone's favorite golden fat juice. In short, we're coming at you with the Epicurious guide to everything you need to know about olive oil right now, in 2019. Check it out below."
   },
   {
      "id": 13,
      "title": "The Best Oil to Cook With Isn’t Olive or Vegetable—It’s Both",
      "img": "https://assets.epicurious.com/photos/5d978c373b5f6c00084ea375/16:9/w_1920,c_limit/AmielOil_HERO_100219_5658.jpg",
      "category": "OLIVE OIL",
      "author": " AMIEL STANEK",
      "date": "October 21, 2019",
      "innerSubTitle": "When you want that Big Olive Oil Energy but don't want to go broke, grab a squeeze bottle and make a blend.",
      "description": "At one of the first restaurants where I was a line-cook, we had three different types of oil on heavy rotation. The first was a standard, no-fuss vegetable oil used primarily for filling the deep fryer. The second was a fancy-seeming extra-virgin olive oil—a “finishing oil”—which was used judiciously, primarily by the chef who drizzled a bit of it onto plates just before they went out to the dining room. The third was a mysteriously-named substance in a yellow jug called “blended oil” which, as its name suggested, was an economical mix of canola oil and (an apparently nominal amount of) extra-virgin olive oil. Thinking back, it probably tasted pretty lousy, but it was our go-to, used with abandon for pan frying, vinaigrettes, aioli, and just about everything else you could think of.\nI never encountered that strange blended oil after I left that job, but I started to think about it again a few years back when, after doing some research, I finally got serious about stocking high-quality extra-virgin olive oil exclusively. I quickly ran into two problems. The first was that my favorite brands were expensive—a small-ish bottle could easily add twenty dollars to my grocery bill—and disappeared alarmingly fast.\nThe second problem was, counterintuitively, how good these oils tasted. I started to find that the same peppery, green-grassy flavors that I loved in these extra-virgin olive oils could easily overpower simple vinaigrettes and overwhelm delicate sautés; I simultaneously had too much flavor and not enough of it."
   },
   {
      "id": 14,
      "title": "Olive Oil Is Better for Cake Than Butter. There, I Said It.",
      "img": "https://assets.epicurious.com/photos/5da874a37ecb61000833dc57/16:9/w_1920,c_limit/OliveOilCake_PROCESS_IG_101619_6123.jpg",
      "category": "OLIVE OIL",
      "author": "DAVID TAMARKIN",
      "date": "October 22, 2019",
      "innerSubTitle": "When it comes to baking fats, butter is great. But it's olive oil that really takes the…you know…",
      "description": "To pit butter versus olive oil is something only an idiot would do. Butter is classical, olive oil is jazz, and anybody who thinks that one is better than the other is not somebody I want to hit the town with.\nSo why I have spent the better part of a month haunted by the conviction that olive oil is superior for cakes?\nIt’s probably just a phase I’m going through. But while I’m here, let's flesh this argument out. First there's the flavor. Where butter is sweet, milky, and often in the background of a cake’s flavor, olive oil is earthy, grassy, and bold. An olive oil cake will always have a savory edge, sometimes even a backnote of bitterness, that a butter cake will lack.\nNext: texture. Olive oil cakes are the world’s moistest, and unlike their butter brothers, which are constantly at risk of drying out, they stay moist for days. Which brings us to another benefit of olive oil cakes: longevity. “I think olive oil cakes kind of get better with age,” says Elizabeth Quijada, the pastry chef at Abraço, a New York City coffee shop that is known for their olive oil cake. “It’s at its prime at three or four days.”\nIf I’m being honest, though, none of the superiorities described above are what has put me on Team Olive Oil. Instead, there’s a fourth reason, especially for a person like me who tries to keep himself in cake at all times. I’m talking about the speed and ease in which olive oil cakes come together."
   },
   {
      "id": 15,
      "title": "What Olive Oils Do Chefs Really Use?",
      "img": "https://assets.epicurious.com/photos/5daf28315f201e0009aa22f2/16:9/w_1920,c_limit/ChefOil_HERO_101619_6324.jpg",
      "category": "OLIVE OIL",
      "author": "ALICIA KENNEDY",
      "date": "October 22, 2019",
      "innerSubTitle": "Shopping for olive oil is confusing, so we asked the pros about their favorites. Here's what chefs and food experts turn to as their go-to fat. ",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nWhile olive oil is a kitchen staple—something home cooks and professionals alike reach for day in and day out as a go-to fat—it's still remarkably confusing to shop for. There has, of course, been quite a bit of controversy surrounding its harvest and authenticity. At the same time, there’s increased awareness of the nuance in olive oil flavor and terroir—thus a crowded, confusing field becomes even more unwieldy to navigate. In cases like these, it’s always best to go to the experts: chefs themselves.\nStill, even chefs have a variety of preferences—and place varying levels of importance on the specific brand—when it comes to olive oil. To some, like Amanda Cohen, the chef at New York City’s Dirt Candy, there’s nothing precious about olive oil. Even though she says she’s up to her elbows in it all day long, using it in salad dressings, as a finisher, and as her go-to cooking oil, she has no specific favorite. “I use whatever my supplier brings me, in part because I like to try new oils all the time, but in part because I’m lazy,” she says. “To be honest, they all cook up pretty much the same, with really only minor variations.”\nOn the other hand, Samin Nosrat, author and host of Netflix's Salt Fat Acid Heat likes to remind people that it’s important to be conscientious; to her it’s not a matter of cooking with cheap oil and finishing with something a bit more expensive, because the overall quality will always make a difference. “Whatever oil you cook with becomes to foundation of the food, 'she says, “So I want my daily oil to be good oil.'\nKeeping in mind that tastes are specific and personal, we asked five chefs about their go-to olive oils hoping to make our own shopping a little easier."
   },
   {
      "id": 16,
      "title": "The Best Cleaning Products For Degreasing Your Stovetop",
      "img": "https://assets.epicurious.com/photos/5ed0074dc6d8a5f84c76be1f/16:9/w_1920,c_limit/STOVETOP_0614_BA_PREP_05_VOG_final.jpg",
      "category": "SHOPPING",
      "author": "LAUREN VIERA",
      "date": "May 28, 2020",
      "innerSubTitle": "Make your stovetop fresh and ready to welcome you back for another night of cooking dinner. ",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nEspecially when you’re so busy cooking all the time, it’s easy to let dishes stack up. Or forget to deodorize the fridge. Or put off oven cleaning. But there’s one area of your kitchen that you should really try to wipe it down on the regular: the stovetop.\nThink of your stovetop like your bed. Chances are, you use it most nights. And even if you’re the type who isn’t bothered by the sight of an unmade bed or a sauce-splattered stovetop during the day, it’s when you crawl into bed at night or go to cook but find that you're setting last night's wayward chickpea on fire that it starts to bother you. You want this space to be fresh and ready, eager to welcome you back.\nEnter the stovetop cleaner. Beyond routinely erasing the mess left by those three-pot meals and splatter-prone red sauces, the best of them can tackle residue from last weekend’s Belgian waffles, and then some. To test some of the most popular stovetop cleaners, I purposefully neglected my porcelain-enamel range for a week (it was gross), then divvied it into a grid for side-by-side product comparisons. Here’s how it went."
   },
   {
      "id": 17,
      "title": "How to Clean Your Oven, Because It’s Not Really Going to Clean Itself",
      "img": "https://assets.epicurious.com/photos/5ac54f383154144b9859859c/16:9/w_1920,c_limit/chicken-in-oven-tray-underneath-3305.jpg",
      "category": "SHOPPING",
      "author": "LAUREN VIERA",
      "date": "May 28, 2020",
      "innerSubTitle": "We tried a bunch of top rated oven-cleaning products. Here are the ones that worked best. ",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nConfession: I may, at first, seem like an unlikely candidate to tell you how to clean your oven. I never clean my oven. Technically, it gets an annual cleaning just after its biggest day of the year: Thanksgiving. The following morning, I make my way to the kitchen to survey the damage, press the self-cleaning button, chill out for the four-plus hours it takes to run its course, then sweep clean whatever burnt-off bits come loose in the process. No elbow grease, no nothing. So sue me.\nIf you clean your own oven with actual products and even the slightest bit of wrist strength, then you’ve already got me beat. Perhaps your oven gets a good cleaning a couple of times a year, which is plenty: most experts recommend doing it seasonally. But now, of course, when we’re cooking more than ever, even the most laid-back oven cleaners among us are beginning to notice increased grease and grime build-up. We may even feel like we can’t safely start cooking again until we deal with yesterday’s dripped bacon grease or pie filling. Since we’re about halfway between last Thanksgiving and next, this is as good a time as any to do a true deep-cleaning. After researching the best oven cleaning products available, I divvied up my oven floor using painter’s tape and cleaned each little box with a separate top-rated cleaner. If you're wondering how to clean your oven using the best products, here’s what worked best, what didn’t work at all, and everything in between."
   },
   {
      "id": 18,
      "title": "The Best Robot Vacuum for Cleaning Your Kitchen Messes (And Your Regular Messes, Too)",
      "img": "https://assets.epicurious.com/photos/5ee138c3c0f6cca21c0e6cb3/16:9/w_1920,c_limit/EPI-ROBOT-VACUUM_ILLO-V3.png",
      "category": "SHOPPING",
      "author": "EMILY JOHNSON",
      "date": "July 23, 2020",
      "innerSubTitle": "We tested 9 top-rated robot vacuums to find the ones that would aid you in your kitchen and dining room cleaning needs. Read on to find the ones that suck up spilled coffee grounds (and spilled flour, and all those sprinkles) best.",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nIn the search for the best robot vacuum, as in life, it's important to manage your expectations.\nIt's only natural to look for a silver bullet: You've been housebound, cleaning up after yourself and your loved ones near constantly, for months now. You've become astounded at the sheer human capacity to create mess; you've felt resentment toward your partner, your less-adorable-than-ever child, even your golden retriever. You're concerned about the robot takeover Andrew Yang is always warning us about, but enough is enough. Let the robots have the vacuuming, you’ll take your $1,000 a month and an extra hour a night for prestige television.\nSadly, even the best robot vacuum will not clean your house for you. Robot vacuums are good for picking up a top layer of dirt, for daily maintenance of keeping the dog hair and spilled coffee grounds at bay, but you'll still need to own a regular vacuum to remove the heavy duty dirt.\nThat said, I'd argue that everyone should own a robot vacuum—and especially right now. Robot vacuums are an endless source of joy. They're delightfully dumb. They bump into things and move in odd patterns. They never quite pick up as much as you want them to. And yet, when one is home all day and desperate for entertainment, the robot vacuum comes through. Watching the sweet little guy whir over your floors, picking up dirt and asking for nothing from you in return, is gratifying. And in Covid times, it even qualifies as fun.\nTo bring that kind of magic back into your life, we tested 9 top-rated models to find the best robot vacuums. Because we're a home cooking site, we paid particular attention to the robo vacs that would aid you in your kitchen and dining room cleaning needs. Read on to find the ones that suck up spilled coffee grounds (and spilled flour, and all those sprinkles) best."
   },
   {
      "id": 19,
      "title": "The Best Pantry Storage Containers for Flour, Sugar, and Beyond",
      "img": "https://assets.epicurious.com/photos/61b926b3aab868c36c9a5305/16:9/w_1920,c_limit/BestPantryStorageContainers_HERO_120621_24393_V1_final.jpg",
      "category": "SHOPPING",
      "author": "JARRETT MELENDEZ",
      "date": "December 27, 2021",
      "innerSubTitle": "Keep your dry goods dry (and safe from pests) with the storage containers commercial kitchens swear by.",
      "description": "All products featured on Epicurious are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nThere’s little on this earth that gives me as much calm joy as a well-organized pantry. Even before I worked in commercial kitchens, I loved keeping my pantry stocked and organized so that I could take on cooking and baking projects without worrying whether I had all the right ingredients, or where on earth that container of spelt flour was. Not only does keeping your pantry organized make life easier, but it helps maximize that precious storage space, and helps keep things cleaner. Nobody likes a pantry full of open bags of flour and sugar—that’s just asking for spills to happen!\nIf you’re the type of person that keeps several kinds of flour on hand for big baking projects, or you keep bulk amounts of beans and lentils and rice around all the time, you should have good storage containers that keep all of your dry goods fresh and, well, dry!\nI’ve used the same commercial kitchen storage containers for years, and swear by them. But I wanted to truly put a variety of brands up against each other to see if regular containers marketed for home use could unseat my preferred pantry storage system. I had a good long look around and grabbed some storage systems from trusted and best-selling brands, along with some recommendations from fellow food pros. Here’s how they did."
   },
   {
      "id": 20,
      "img": "https://assets.epicurious.com/photos/6335f0de34bc310780b276c7/16:9/w_1600,c_limit/wallniture-24-inch-gourmet-kitchen-rail_HERO_092822_11384_VOG_final.jpg",
      "category": "Brussels Sprout",
      "title": "Your Kitchen Probably Needs a Pot Rail",
      "innerSubTitle": "This is the lowest-stakes kind of gift exchange—which means it should be the most fun.",
      "author": "EMILY FARRIS",
      "description": "It’s a tradition known by many names: White Elephant, Yankee Swap, Dirty Santa. The storied annual event, the essential pillar of our culture, wherein coworkers, extended family, or large friend groups gather together to exchange gag gifts or iscellaneous objects surfaced from deep within their junk drawers. How would the novelty waffle maker, desktop zen garden, or fart button industrial complexes sustain themselves, if not for the white elephant gift exchange? The delightful thing about white elephant is that it’s probably the lowest-stakes gift-giving scenario of the holiday season. For that reason, compiling a list of the best white elephant gifts does feel a little antithetical to the spontaneous, ça ne fait rien spirit of the whole thing. That would be true, if it weren’t for the fact that I have endured several white elephant gift exchanges where the gifts have been repeats. The gifts were boring—uninspired, even. I kept seeing the same cocktail kits, the same silicone tea strainers shaped like little fellas that hang off the side of a mug, the same curly-script Wine Mom wine glass. How can it be that the most “anything goes” gifting tradition somehow results in the same old stuff? This is what I come with you today with a list of white elephant gift ideas full of items that embrace the creativity and freedom that are core to the event. My list includes a balance of the practical and the absurd. All of the items serve, in one way or another, to enhance the overall fun atmosphere of the white elephant exchange.The ideal equation for a white elephant gift includes some combination of useful + interesting + uncommon; you don’t have to hit all three every time, but you should aim for at least two. Quirky gifts are ideal, but aim for something that isn’t trying too hard to be a joke. Bonus points if you opt for oddly shaped packages to enhance the absurdity and mystery of the day.",
      "date": "12.23.22"
   },
   {
      "id": 21,
      "img": "https://assets.epicurious.com/photos/62267aec280d108b91b7ceb7/1:1/w_800%2Cc_limit/BostonCreamPie_HERO_030322_29186.jpg",
      "category": "SHOPPING",
      "title": "A Mildly Chaotic White Elephant Gift Guide for Folks Who Want Something Truly Unique",
      "innerSubTitle": "This is the lowest-stakes kind of gift exchange—which means it should be the most fun.",
      "author": "WILDER DAVIES",
      "description": "It’s a tradition known by many names: White Elephant, Yankee Swap, Dirty Santa. The storied annual event, the essential pillar of our culture, wherein coworkers, extended family, or large friend groups gather together to exchange gag gifts or iscellaneous objects surfaced from deep within their junk drawers. How would the novelty waffle maker, desktop zen garden, or fart button industrial complexes sustain themselves, if not for the white elephant gift exchange? The delightful thing about white elephant is that it’s probably the lowest-stakes gift-giving scenario of the holiday season. For that reason, compiling a list of the best white elephant gifts does feel a little antithetical to the spontaneous, ça ne fait rien spirit of the whole thing. That would be true, if it weren’t for the fact that I have endured several white elephant gift exchanges where the gifts have been repeats. The gifts were boring—uninspired, even. I kept seeing the same cocktail kits, the same silicone tea strainers shaped like little fellas that hang off the side of a mug, the same curly-script Wine Mom wine glass. How can it be that the most “anything goes” gifting tradition somehow results in the same old stuff? This is what I come with you today with a list of white elephant gift ideas full of items that embrace the creativity and freedom that are core to the event. My list includes a balance of the practical and the absurd. All of the items serve, in one way or another, to enhance the overall fun atmosphere of the white elephant exchange.The ideal equation for a white elephant gift includes some combination of useful + interesting + uncommon; you don’t have to hit all three every time, but you should aim for at least two. Quirky gifts are ideal, but aim for something that isn’t trying too hard to be a joke. Bonus points if you opt for oddly shaped packages to enhance the absurdity and mystery of the day.",
      "date": "12.14.22"
   },
   {
      "id": 22,
      "img": "https://assets.epicurious.com/photos/6283a7784ef547c8ce3ad5d6/1:1/w_960,c_limit/NoBakeCheesecake_HERO_051222_33813.jpg",
      "category": "SHOPPING",
      "title": "All the GIft Ideas From Epicurious",
      "innerSubTitle": "Our hub for holiday gift inspiration, with ideas for every lucky recipient on your list.",
      "author": "EMILY JOHNSON & THE EDITORS OF EPICURIOUS",
      "description": "At first, buying a holiday gift for someone who loves to cook and eat seems easy: Killer cookware, something delicious to eat, or a lifesaving kitchen tool all jump out as obvious choices. But as soon as you start to think specifically about the person you're shopping for, you’ll probably realize it’s more complicated. Serious cooks often have every piece of cookware they need; so you’ll need a gift for people who already own top-notch skillets and Dutch ovens, and we’ve got that. We’ve got gifts for people who like growing their produce as much as they like sautéing it with butter and herbs. We’ve got gifts for people whose hot sauce collection takes up more space than their fridge door can handle. We’ve got gifts for people whose whole personality is the cheese board they bring to the party. And ideas for people who just want to cozy up next to a fire all winter long. We’ve also thought about the gifting situations you’re likely to find yourself in, whether that’s a multigenerational family get together or a holiday party where you barely know the host. We got specific in our gift guides this year, because we know you don’t want to go down as that person who gave generic junk. Find the full list of curated gift ideas for everyone on your list below.",
      "date": "12.14.22"
   },
   {
      "id": 23,
      "img": "https://assets.epicurious.com/photos/6348395b972661170c935446/1:1/w_960,c_limit/caraway-cookware-set_HERO_101222_11733_V1_final.jpg",
      "category": "GIFT GUIDE",
      "title": "49 Wine Gifts for Oenophiles (That Aren't Cutesy Charms for Their Glasses)",
      "innerSubTitle": "The fanciest wine glass. An opener for old corks. And a reminder to hydrate.",
      "author": "MAGGIE HOFFMAN, EMILY JOHNSON & EMILY FARRIS",
      "description": "Every year, as the holidays come around, we feel the need to shout to the rooftops: “The best gifts for wine lovers are actual bottles of wine!” Because it’s true that more than anything, oenophiles want good wine, not dumb gadgets. Not a motorized bottle opener, not cheesy wine-themed word art, and not grape-shaped charms to hang on our glasses. And we definitely don’t want a gift basket with all of those things plus a bunch of random filler we’ll never touch. Nope, it’s wine we want. Good old-fashioned wine.But here’s the hard part about wine gifts: Serious wine lovers generally only want wine that fits into a narrow category of specific personal preferences. And unless you’re willing to do some sleuthing—or happen to know as much as they do about winemaking regions, varietals, and vintages—it can be near impossible to figure out what bottle to buy for your wine-loving loved one. The good news is that there’s a happy medium because it’s totally possible to buy a wine-adjacent gift that’s not an electronic opener, a farmhouse-chic wine sign, or a set of bedazzled glass charms. There are plenty of tools, totes, and edible gifts wine lovers will actually want and use—and we know this because we happen to be wine lovers ourselves. So to help you find the perfect gift for the wine lover in your life, we rounded up the wine-related items we actually use, along with a few wine gifts we’d be thrilled to receive this year. We even included a set of not-cheesy felt wine glass markers along with suggestions for a few good bottles just in case you’re dead set on going that route.",
      "date": "12.14.22"
   },
   {
      "id": 24,
      "img": "https://assets.epicurious.com/photos/6283a7784ef547c8ce3ad5d6/1:1/w_960,c_limit/NoBakeCheesecake_HERO_051222_33813.jpg",
      "category": "GIFT GUIDE",
      "title": "The 41 Best Gifts for Tea Lovers.",
      "innerSubTitle": "Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
      "author": "ASHLEY MASON & WILDER DAVIES",
      "description": "The best gifts for tea lovers include accessories that help establish a ritual and make each cup the best cup of tea it can be, like a peerless electric kettle or a delicate matcha whisk. And a luxurious tin of tea is always a good idea, of course. After all, some people live their lives with their pinkies up—which is to say, if there is an opportunity for tea, you better believe they’re going to take it. These holiday gifts just might provide more of those opportunities",
      "date": "12.14.22"
   },
   {
      "id": 25,
      "img": "https://assets.epicurious.com/photos/63977b3a17b0aaa43ced81f0/1:1/w_960,c_limit/ChimneySweepIceCream_HERO_120822_44001.jpg",
      "category": "SHOPPING",
      "title": "34 Holiday Gifts the Epi Team is Giving This Year",
      "innerSubTitle": "Baking tools, funky mugs, and the best crunchy nut butter.",
      "author": "KENDRA VACULIN, WILDER DAVIS & EMILY JOHNSON",
      "description": "Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
      "date": "12.13.22"
   },
   {
      "id": 26,
      "img": "https://assets.epicurious.com/photos/637bd9a0d76aa15587578cd6/1:1/w_960,c_limit/KingCake_HERO_111622_42500.jpg",
      "category": "CHICKEN",
      "title": "Yes. You can Roast a Whole Chicken in Your Air Fryer",
      "innerSubTitle": "Baking tools, funky mugs, and the best crunchy nut butter.",
      "author": "STEVE ORLANDO",
      "description": "Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
      "date": "12.12.22"
   },
   {
      "id": 27,
      "img": "https://assets.epicurious.com/photos/63979f46ca0105ba469bb156/1:1/w_960,c_limit/AcidPhosphateDrinks_HERO_120822_43903.jpg 960w",
      "category": "SHOPPING",
      "title": "The Best Last-Minute Kitchen Gifts",
      "innerSubTitle": "Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
      "author": "WILDER DAVIES",
      "description": "Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
      "date": "12.10.22"
   },
   {
      "id": 28,
      "img": "https://assets.epicurious.com/photos/63977b3a17b0aaa43ced81f0/1:1/w_960,c_limit/ChimneySweepIceCream_HERO_120822_44001.jpg",
      "category": "SMALL PLATES",
      "title": "The Best Coocking Gifts for Kids",
      "innerSubTitle": "Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
      "author": "EMILY FARRIS & POOJA MAKHIJANI",
      "description": "Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
      "date": "12.10.22"
   },
   {
      "id": 29,
      "img": "https://assets.epicurious.com/photos/6363e4f165b53ff6569baab2/16:9/w_960,c_limit/20220215%20Turkish%20Eggs%20LEDE.jpg",
      "category": "SHOPPING",
      "title": "The Best All-Clad Factory Sale Deals Online Right Now",
      "innerSubTitle": "Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
      "author": "THE EDITORS OF EPICURIOUS",
      "description": "Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
      "date": "12.10.22"
   },
   {
      "id": 30,
      "img": "https://assets.epicurious.com/photos/6388cfdc0ab2ad422d5fe500/1:1/w_960,c_limit/Best-Cookbooks-2022_HERO_113022_12739_VOG_final.jpg",
      "category": "SHOPPING",
      "title": "The 29 Cooking Tools Our Editors Loved This Year",
      "innerSubTitle": "Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
      "author": "MEGAN WAHN",
      "description": "Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
      "date": "12.10.22"
   },
   {
      "id": 31,
      "title": "Holiday Gifts for Cooks and Food Lovers",
      "img": "https://assets.epicurious.com/photos/63877c8ed6dcac4735e54867/16:9/w_1920,c_limit/GiftGuide2022_HERO_113022_42923.jpg",
      "category": "SHOPPING",
      "author": "EMILY JOHNSON AND THE EDITORS OF EPICURIOUS",
      "date": "December 13, 2022",
      "innerSubTitle": "Our hub for holiday gift inspiration, with ideas for every lucky recipient on your list.",
      "description": "At first, buying a holiday gift for someone who loves to cook and eat seems easy: Killer cookware, something delicious to eat, or a lifesaving kitchen tool all jump out as obvious choices. But as soon as you start to think specifically about the person you're shopping for, you’ll probably realize it’s more complicated. Serious cooks often have every piece of cookware they need; so you’ll need a gift for people who already own top-notch skillets and Dutch ovens, and we’ve got that. We’ve got gifts for people who like growing their produce as much as they like sautéing it with butter and herbs. We’ve got gifts for people whose hot sauce collection takes up more space than their fridge door can handle. We’ve got gifts for people whose whole personality is the cheese board they bring to the party. And ideas for people who just want to cozy up next to a fire all winter long. We’ve also thought about the gifting situations you’re likely to find yourself in, whether that’s a multigenerational family get together or a holiday party where you barely know the host. We got specific in our gift guides this year, because we know you don’t want to go down as that person who gave generic junk. Find the full list of curated gift ideas for everyone on your list below."
   },
   {
      "id": 32,
      "title": "41 Foolproof Gifts for People You Don't Really Know",
      "img": "https://assets.epicurious.com/photos/636ea6c448052e7ad54155a9/16:9/w_1920,c_limit/artifaqt-design-asparagus-beeswax-taper-candles_HERO_110922_12421_V1_final.jpg",
      "category": "GIFT GUIDE",
      "author": "WILDER DAVIES",
      "date": "December 6, 2022",
      "innerSubTitle": "Never get caught giving that lame candle again.",
      "description": "Let’s face an age-old problem head on here: There are times where we feel compelled, or are obligated by social conditions, to buy gifts for acquaintances we don’t know very well. And we may simply…not care enough to try very hard. Sure, you can, in the words of this perennially relevant SNL skit, “go into your closet just to see what crap is in there,” excavating a crappy candle to offload on a poor unsuspecting victim before calling it a day. But the truth is, the act of gift giving is really about you, the gift giver, more than it's about the gift receiver's material gain. The gift you give is a demonstration of your capacity for thoughtfulness and a measurement of your taste. If you give a crappy candle, you risk a crappy reputation. And this holiday season we should all be concerned with our own reputations first and foremost.\nGiven the high-stakes social politics of “gifts for acquaintances” this time of year, it's no wonder people suffer from analysis paralysis and throw in the towel, dubbing themselves “bad gift givers.” Luckily, I'm here to help you escape that fate. In my opinion, a bad gift giver is merely an unprepared gift giver. So let’s get you prepared. \nBelow you'll find a list of foolproof gifts for people you don't know super well—your coworkers, your boyfriend's mom's friend who randomly showed up at your holiday dinner, your sister's new girlfriend who you don't think will be in the picture very long but who your mom begged you to make feel welcome, and so on.  You'll notice there's an emphasis on food and food-related items, because, well, we are a food website. But also, here's a great point: Everybody eats, which makes food perfect for cordial and not-so-intimate gifts. Don't worry, though, you won't find any tacky fruit baskets or edible arrangements in sight. "
   },
   {
      "id": 33,
      "title": "35 Gifts for Gardeners That Are Actually Good",
      "img": "https://assets.epicurious.com/photos/62558f86152bb297244ffa23/16:9/w_1920,c_limit/best-gardening-gloves_HERO_041122_6778_VOG_NocBadge_final.jpg",
      "category": "GIFT GUIDE",
      "author": "WILDER DAVIES",
      "date": "October 31, 2022",
      "innerSubTitle": "Practical-yet-niche tools, beautifully designed attire for mucking about outside, and things they wouldn't think to buy themselves. ",
      "description": "You might be looking for the best gifts for gardeners for this first time this year, because in today's world, there are a lot more people who love to garden. Like many activities that don't require leaving the house, gardening has seen a boom in popularity the past couple of years for reasons I don't need to mention. Personally, I love to garden so much that I have tricked my workplace into letting me write about it regularly, even though this is a food website. And all this extra time spent at home has only served to intensify my passion for gardening, leaving me destined to spend all winter daydreaming about next year's growing season. If you have a loved one who happens to also be a dedicated gardener, chances are they're also likely resting on the windowsill in somber repose, waiting for spring to come. All the more reason to give them a gift they can look forward to using once the time comes to get back out into the yard.\nHere's the thing though: If you yourself aren't an owner of a green thumb, there's a good chance the most obvious gift ideas that come to mind won't be what a gardener needs.  Your beloved plant lover probably wont be too enthused over a grow kit for an indoor herb garden, a tote that says 'I <3 Succulents', or a glass terrarium.  You can do much better than that. \nI compiled this list of the best gifts for gardeners, including practical-yet-niche tools, beautifully designed attire for mucking about outside, and things they wouldn't think to buy themselves. If you don't know much about gardening, don't worry; put down the bird feeder (a.k.a. squirrel magnet) and I'll help you out. Read on for all the best gifts for gardeners."
   },
   {
      "id": 34,
      "title": "21 Gifts for Minimalists That Won’t End Up in the Donate Pile",
      "img": "https://assets.epicurious.com/photos/63692e480b9719125777cbbe/16:9/w_1920,c_limit/brightland-the-artist-capsule_HERO_110122_12257_VOG_final.jpg",
      "category": "SHOPPING",
      "author": "EMILY FARRIS",
      "date": "December 7, 2022",
      "innerSubTitle": "Even the pickiest person will appreciate specialty condiments, gorgeous taper candles, or a versatile grocery tote.",
      "description": "From a purely logical standpoint, the best gift for a minimalist is no gift at all. That’s because the folks who are truly dedicated to a minimal lifestyle have carefully curated their belongings, keeping only what they need, as well as a few items they really, really love. It’s why their homes always seem so tidy and why they can pull off those gorgeous open cabinets in the kitchen even if they cook a lot.\nMinimalists generally also put a lot of thought into what makes it into their homes, and something that may seem beautiful and useful to you might actually stress them out—especially if they worry getting rid of it might hurt your feelings. Combine all of that with the fact that many also happen to be intimidatingly stylish people, and the thought of finding the perfect gift for a minimalist can start to feel like a lost cause. \nBut let’s be real: giving nothing is no fun for anybody. And while cash and gift cards are always useful, they’re not exactly fun to give or receive either. So before you throw your hands up in the air (or default to yet another boring gift card) check out this list of the best gifts for minimalists. Most of the items happen to be our specialty here at Epi—edible goods that won’t stay in the kitchen long. I’ve also thrown in a handful of other consumables for the home that don’t last forever, like flowers and candles, as well as a small selection of high-quality items that aren’t going to end up in the “donate” pile. "
   }
]
