[
    {
        "id": 1,
        "cardImg": "https://assets.epicurious.com/photos/62267aec280d108b91b7ceb7/1:1/w_800%2Cc_limit/BostonCreamPie_HERO_030322_29186.jpg",
        "cardCategory": "SHOPPING",
        "cardHeading": "A Mildly Chaotic White Elephant Gift Guide for Folks Who Want Something Truly Unique",
        "cardSubHeading":"This is the lowest-stakes kind of gift exchange—which means it should be the most fun.",
        "adviceBy": "WILDER DAVIES",
        "details":"It’s a tradition known by many names: White Elephant, Yankee Swap, Dirty Santa. The storied annual event, the essential pillar of our culture, wherein coworkers, extended family, or large friend groups gather together to exchange gag gifts or iscellaneous objects surfaced from deep within their junk drawers. How would the novelty waffle maker, desktop zen garden, or fart button industrial complexes sustain themselves, if not for the white elephant gift exchange? The delightful thing about white elephant is that it’s probably the lowest-stakes gift-giving scenario of the holiday season. For that reason, compiling a list of the best white elephant gifts does feel a little antithetical to the spontaneous, ça ne fait rien spirit of the whole thing. That would be true, if it weren’t for the fact that I have endured several white elephant gift exchanges where the gifts have been repeats. The gifts were boring—uninspired, even. I kept seeing the same cocktail kits, the same silicone tea strainers shaped like little fellas that hang off the side of a mug, the same curly-script Wine Mom wine glass. How can it be that the most “anything goes” gifting tradition somehow results in the same old stuff? This is what I come with you today with a list of white elephant gift ideas full of items that embrace the creativity and freedom that are core to the event. My list includes a balance of the practical and the absurd. All of the items serve, in one way or another, to enhance the overall fun atmosphere of the white elephant exchange.The ideal equation for a white elephant gift includes some combination of useful + interesting + uncommon; you don’t have to hit all three every time, but you should aim for at least two. Quirky gifts are ideal, but aim for something that isn’t trying too hard to be a joke. Bonus points if you opt for oddly shaped packages to enhance the absurdity and mystery of the day.",
        "postDate": "12.14.22"
    },
    {
        "id": 2,
        "cardImg": "https://www.epicurious.com/shopping/in-praise-of-the-dough-hook-the-unsung-hero-of-kitchenaid-attachments",
        "cardCategory": "SHOPPING",
        "cardHeading": "All the GIft Ideas From Epicurious",
        "cardSubHeading":"Our hub for holiday gift inspiration, with ideas for every lucky recipient on your list.",
        "adviceBy": "EMILY JOHNSON & THE EDITORS OF EPICURIOUS",
        "details":"At first, buying a holiday gift for someone who loves to cook and eat seems easy: Killer cookware, something delicious to eat, or a lifesaving kitchen tool all jump out as obvious choices. But as soon as you start to think specifically about the person you're shopping for, you’ll probably realize it’s more complicated. Serious cooks often have every piece of cookware they need; so you’ll need a gift for people who already own top-notch skillets and Dutch ovens, and we’ve got that. We’ve got gifts for people who like growing their produce as much as they like sautéing it with butter and herbs. We’ve got gifts for people whose hot sauce collection takes up more space than their fridge door can handle. We’ve got gifts for people whose whole personality is the cheese board they bring to the party. And ideas for people who just want to cozy up next to a fire all winter long. We’ve also thought about the gifting situations you’re likely to find yourself in, whether that’s a multigenerational family get together or a holiday party where you barely know the host. We got specific in our gift guides this year, because we know you don’t want to go down as that person who gave generic junk. Find the full list of curated gift ideas for everyone on your list below.",
        "postDate": "12.14.22"
    },
    {
        "id": 3,
        "cardImg": "https://assets.epicurious.com/photos/6348395b972661170c935446/1:1/w_960,c_limit/caraway-cookware-set_HERO_101222_11733_V1_final.jpg",
        "cardCategory": "GIFT GUIDE",
        "cardHeading": "49 Wine Gifts for Oenophiles (That Aren't Cutesy Charms for Their Glasses)",
        "cardSubHeading":"The fanciest wine glass. An opener for old corks. And a reminder to hydrate.",
        "adviceBy": "MAGGIE HOFFMAN, EMILY JOHNSON & EMILY FARRIS",
        "details":"Every year, as the holidays come around, we feel the need to shout to the rooftops: “The best gifts for wine lovers are actual bottles of wine!” Because it’s true that more than anything, oenophiles want good wine, not dumb gadgets. Not a motorized bottle opener, not cheesy wine-themed word art, and not grape-shaped charms to hang on our glasses. And we definitely don’t want a gift basket with all of those things plus a bunch of random filler we’ll never touch. Nope, it’s wine we want. Good old-fashioned wine.But here’s the hard part about wine gifts: Serious wine lovers generally only want wine that fits into a narrow category of specific personal preferences. And unless you’re willing to do some sleuthing—or happen to know as much as they do about winemaking regions, varietals, and vintages—it can be near impossible to figure out what bottle to buy for your wine-loving loved one. The good news is that there’s a happy medium because it’s totally possible to buy a wine-adjacent gift that’s not an electronic opener, a farmhouse-chic wine sign, or a set of bedazzled glass charms. There are plenty of tools, totes, and edible gifts wine lovers will actually want and use—and we know this because we happen to be wine lovers ourselves. So to help you find the perfect gift for the wine lover in your life, we rounded up the wine-related items we actually use, along with a few wine gifts we’d be thrilled to receive this year. We even included a set of not-cheesy felt wine glass markers along with suggestions for a few good bottles just in case you’re dead set on going that route.",
        "postDate": "12.14.22"
    },
    {
        "id": 4,
        "cardImg": "https://assets.epicurious.com/photos/6283a7784ef547c8ce3ad5d6/1:1/w_960,c_limit/NoBakeCheesecake_HERO_051222_33813.jpg",
        "cardCategory": "GIFT GUIDE",
        "cardHeading": "The 41 Best Gifts for Tea Lovers.",
        "cardSubHeading":"Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
        "adviceBy": "ASHLEY MASON & WILDER DAVIES",
        "details":"The best gifts for tea lovers include accessories that help establish a ritual and make each cup the best cup of tea it can be, like a peerless electric kettle or a delicate matcha whisk. And a luxurious tin of tea is always a good idea, of course. After all, some people live their lives with their pinkies up—which is to say, if there is an opportunity for tea, you better believe they’re going to take it. These holiday gifts just might provide more of those opportunities",
        "postDate": "12.14.22"
    },
    {
        "id": 5,
        "cardImg": "https://assets.epicurious.com/photos/63977b3a17b0aaa43ced81f0/1:1/w_960,c_limit/ChimneySweepIceCream_HERO_120822_44001.jpg",
        "cardCategory": "SHOPPING",
        "cardHeading": "34 Holiday Gifts the Epi Team is Giving This Year",
        "cardSubHeading":"Baking tools, funky mugs, and the best crunchy nut butter.",
        "adviceBy": "KENDRA VACULIN, WILDER DAVIS & EMILY JOHNSON",
        "details":"Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
        "postDate": "12.13.22"
    },
    {
        "id": 6,
        "cardImg": "https://assets.epicurious.com/photos/637bd9a0d76aa15587578cd6/1:1/w_960,c_limit/KingCake_HERO_111622_42500.jpg",
        "cardCategory": "CHICKEN",
        "cardHeading": "Yes. You can Roast a Whole Chicken in Your Air Fryer",
        "cardSubHeading":"Baking tools, funky mugs, and the best crunchy nut butter.",
        "adviceBy": "STEVE ORLANDO",
        "details":"Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
        "postDate": "12.12.22"
    },
    {
        "id": 7,
        "cardImg": "https://assets.epicurious.com/photos/63979f46ca0105ba469bb156/1:1/w_960,c_limit/AcidPhosphateDrinks_HERO_120822_43903.jpg 960w",
        "cardCategory": "SHOPPING",
        "cardHeading": "The Best Last-Minute Kitchen Gifts",
        "cardSubHeading":"Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
        "adviceBy": "WILDER DAVIES",
        "details":"Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
        "postDate": "12.10.22"
    },
    {
        "id": 8,
        "cardImg": "https://assets.epicurious.com/photos/63977b3a17b0aaa43ced81f0/1:1/w_960,c_limit/ChimneySweepIceCream_HERO_120822_44001.jpg",
        "cardCategory": "SMALL PLATES",
        "cardHeading": "The Best Coocking Gifts for Kids",
        "cardSubHeading":"Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
        "adviceBy": "EMILY FARRIS & POOJA MAKHIJANI",
        "details":"Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
        "postDate": "12.10.22"
    },
    {
        "id": 9,
        "cardImg": "https://assets.epicurious.com/photos/6363e4f165b53ff6569baab2/16:9/w_960,c_limit/20220215%20Turkish%20Eggs%20LEDE.jpg",
        "cardCategory": "SHOPPING",
        "cardHeading": "The Best All-Clad Factory Sale Deals Online Right Now",
        "cardSubHeading":"Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
        "adviceBy": "THE EDITORS OF EPICURIOUS",
        "details":"Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
        "postDate": "12.10.22"
    },
    {
        "id": 10,
        "cardImg": "https://assets.epicurious.com/photos/6388cfdc0ab2ad422d5fe500/1:1/w_960,c_limit/Best-Cookbooks-2022_HERO_113022_12739_VOG_final.jpg",
        "cardCategory": "SHOPPING",
        "cardHeading": "The 29 Cooking Tools Our Editors Loved This Year",
        "cardSubHeading":"Stovetop or electric kettle fanatics, fans of high-caffeine matcha or low-key chamomile—don’t worry, we’ve got every type of tea lover covered.",
        "adviceBy": "MEGAN WAHN",
        "details":"Not to brag, but we at Epicurious are very good at giving holiday gifts. This is because we spend way more time than is normal or advised thinking about the best cooking tools, pretty tabletop items, and craveable snacks and condiments. We use this knowledge to stock our own kitchens, certainly, but when the holiday season rolls around, we pull from that same roster of products we know and love to shop for everyone on our lists.",
        "postDate": "12.10.22"
    }
]