[
    {
       "id": 1,
       "title": "31 Ways to Make Crispy, Crunchy, Caramelized Brussels Sprouts",
       "img": "https://assets.epicurious.com/photos/5dd2ee4256c4b30009ff24be/16:9/w_1920%2Cc_limit/Brussels_sprouts_with_pistachios_and_lime_recipe_BA_111819.jpg",
       "category": "Brussels Sprout",
       "author": "The editor of epicurious",
       "date": "11.15.22",
       "innerSubTitle": "Okay, they’re not actually baby cabbages. But they are adorable and delicious. ",
       "description": "Sure, brussels sprouts had some dark, mushy, overcooked days. But in recent years we've learned how fantastic they can be if you have the right brussels sprouts recipes. We love these little guys shaved in a slaw or glazed until glistening or roasted, cut side down, until chip-like and crispy. Here are a few of our favorite ways to serve brussels sprouts now, whether you're putting a weeknight dinner on the table or trying to bring an all-star side to Thanksgiving."
    },
    {
       "id": 2,
       "title": "7 Great Substitutes for Cornstarch",
       "img": "https://assets.epicurious.com/photos/627ac14e3e7652f84d17a49a/16:9/w_1920,c_limit/cornstarch-macro-051022.jpg",
       "category": "KITCHEN INTELLIGENCE",
       "author": "CAMRYN RABIDEAU",
       "date": "11.12.22",
       "innerSubTitle": "Mid-recipe? Don’t fret. You probably have a cornstarch substitute somewhere in your pantry.",
       "description": "Next time you’re in the middle of making dinner and suddenly realize you’re out of cornstarch, don’t panic. Cornstarch substitutes abound—and there’s a good chance one (or more) of them is already in your pantry. But first, a brief lesson on what cornstarch is and what it does: Cornstarch is the powdered endosperm of corn kernels. (In the UK, cornstarch is called cornflour; in the States, “corn flour” generally refers to finely milled cornmeal, i.e., whole ground corn kernels.) The fine white powder is frequently used for thickening sauces, stews, and custards. It’s a staple in stir-fry recipes, in which it’s used to produce a glossy coating, but it can also be used in cookies and cakes to create a light, crumbly texture, and in fried foods to enhance their crisp exterior.Some sources cite glucomannan, ground flaxseeds, or guar gum as substitutes for cornstarch, but these don’t deliver the same texture and may impart unwanted flavors. Still, there are plenty of other ready ingredients you can swap in for cornstarch to achieve similar results—the best one to choose depends on what type of recipe you’re making."
    },
    {
       "id": 3,
       "title": "37 Pumpkin Purée Recipes That Aren’t Just Another Pie",
       "img": "https://assets.epicurious.com/photos/5b981abb8127422e2d2f45cd/16:9/w_1920%2Cc_limit/Pumpkin-and-Cookie-Butter-Sheet-Cake-With-Toasted-Meringue-recipe-05092018.jpg",
       "category": "RECIPE ROUNDUP",
       "author": "THE EDITORS OF EPICURIOUS",
       "date": "11.09.22",
       "innerSubTitle": "Listen, we love pumpkin pie, but there are so many more places that can of pumpkin purée can go.",
       "description": "If you’re looking for the best pumpkin pie to bake, you’re in the wrong place. (Head over here!) Still with us? Great! Because we’ve compiled our favorite pumpkin purée recipes here, including fall cakes, perfectly spiced doughnuts, soothing soups, easy quick breads, and creamy pastas. These recipes give you options for using up the dregs of a can of leftover pumpkin purée—as well as ideas for what to do with any additional cans taking up precious cabinet space. But be forewarned, once you start scrolling you might just realize you don’t have enough canned pumpkin purée to make every recipe that catches your eye. Need to stock up? Find our favorite brand right over here."
    },
    {
       "id": 4,
       "title": "71 Pasta Recipes to Cook If Spaghetti Is Your Love Language",
       "img": "https://assets.epicurious.com/photos/5ae362adf8542520401e0d86/16:9/w_1920%2Cc_limit/Cauliflower-Carbonara-03012018.jpg",
       "category": "RECIPE ROUNDUP",
       "author": "JULIA PRICE BARON AND THE EDITORS OF EPICURIOUS",
       "date": "11.03.22",
       "innerSubTitle": "Or bucatini. Or linguine. Or orzo. Or… you get the picture.",
       "description": "If there’s one category of food I can fully get behind, it’s pasta—and these pasta recipes don’t disappoint. Although my dinner party default dish has long been lasagna and I get weak in the knees for a classic basil pesto, the truth is I’ll take any kind of pasta any day (and any meal) of the week. Between our easy stuffed shells, homemade gluten-free fresh pasta, creamy vegan ziti, and chorizo-sauced spaghetti, I’m convinced that the following collection of flavorful and easy recipes holds unifying, world peace pastability. (I just couldn’t resist.)"
    },
    {
       "id": 5,
       "title": "29 Recipes That Turn a Rotisserie Chicken Into Dinner",
       "img": "https://assets.epicurious.com/photos/5a7894d5c6aea21096d5582f/16:9/w_1920%2Cc_limit/Filipino-Cure-for-the-Common-Cold-31012018.jpg",
       "category": "RECIPE ROUNDUP",
       "author": "THE EDITORS OF EPICURIOUS",
       "date": "10.19.22",
       "innerSubTitle": "You can eat it hot, you can eat it cold. But you can also make something new (and delicious!) out of that store-bought rotisserie chicken.",
       "description": "Pick up a rotisserie chicken and dinner is easy. But we don’t just mean cutting up that bird to eat unadorned. These rotisserie chicken recipes help you transform cooked chicken into a wide variety of flavorful meals without much prep. Shredded chicken can add protein and heft to soups, salads, pasta bakes, and more, and there are lots of ideas below for using up the last bits of a store-bought rotisserie chicken—or a whole bird, which probably means you want to pick up two in the first place. Scroll down for weeknight dinner ideas and no-fuss dinner party inspiration."
    },
    {
       "id": 6,
       "title": "The Best Crushed Red Pepper Flakes Are DIY",
       "img": "https://assets.epicurious.com/photos/632e0b863d8214ad950281ec/16:9/w_1920,c_limit/ChiliFlakes_HERO_092222_40160.jpg",
       "category": "CHILE",
       "author": "MATTHEW TRUEHERZ",
       "date": "10.18.22",
       "innerSubTitle": "Making your own means fresh, on-demand flakes that are perfect for whatever you have cooking.",
       "description": "If salt and pepper are the two busiest members of the spice cabinet, crushed red pepper flakes are surely third. And like salt and pepper, it’s easy to take them for granted—to presume they are an unchanging, perpetually stable seasoning that makes whatever you’re eating a bit more spicy.Red pepper flakes, a.k.a. crushed red pepper, and in some circles, chile flakes (the ones with the trademark seeds left in the mix) are all, ostensibly, the same thing. It’s easy enough to take them at face value, as an ingredient that generically spices up pizza, pasta, or sautéed greens.But these ubiquitous flecks present an opportunity for so much more. Aside from adding a kick to your favorite dishes, both in the pan and on the plate, chiles can bring deeply nuanced fruity notes and a range of different characters of heat, based on which type you’re using. There are milder, sweeter chiles that you can sprinkle liberally over hummus and into salad dressing or a pot of stewing lentils. And there are fiery chiles that can add a hard edge to laabs, curries, and anything alla diavola."
    },
    {
       "id": 7,
       "title": "23 Acorn Squash Recipes We’re Squirreling Away for Fall and Winter",
       "img": "https://assets.epicurious.com/photos/5ba010d0fe44ba546264204b/16:9/w_1920%2Cc_limit/Sheet-Pan-Roasted-Squash-and-Feta-Salad-13092018.jpg",
       "category": "RECIPE ROUNDUP",
       "author": "MEREDITH STETTNER AND THE EDITORS OF EPICURIOUS",
       "date": "10.07.22",
       "innerSubTitle": "Our best recipes for acorn squash include slow-roasted vegetable salads, quick weeknight dinner ideas, and a creamy custard pie.",
       "description": "Acorn squash is an adaptable ingredient, equally at home in a weekday salad or dinner party–worthy entrée. Our favorite acorn squash recipes highlight that versatility, proving that autumnal cooking doesn’t have to involve sugared cranberries, brown butter, or pumpkin spice to feel thoroughly seasonal—although using any of those ingredients sure wouldn’t hurt. Want something rich and warming that could double as dessert? Cook acorn squash halves with maple syrup until rich and buttery, à la Ina Garten. Or, if you crave a wholesome autumnal supper, try acorn squash stuffed with wild rice, kale, and other hearty fall fare. Whether you’re looking for a side dish for an upcoming holiday, an easy weeknight supper, or a seasonal dinner party main, there’s an acorn squash recipe to fit the bill below."
    },
    {
       "id": 8,
       "title": "The Best Substitutes for Cake Flour and Self-Rising Flour",
       "img": "https://assets.epicurious.com/photos/55c0c7d7ebc27eda122cf9a1/16:9/w_1920,c_limit/EP_07282015_dumpcakes_cakemix_recipeimage.jpg",
       "category": "BAKING",
       "author": "KELLY VAUGHAN AND SHEELA PRAKASH",
       "date": "10.14.22",
       "innerSubTitle": "Don’t skip a recipe just because it calls for special flour. All you need is all-purpose flour and some good old-fashioned ingenuity.",
       "description": "All-purpose flour is a pantry essential, but with a little tweaking, it can also serve as a substitute for cake flour, self-rising flour, and other specialty flours. While most home bakers rely on all-purpose flour for baking tender chocolate chip cookies and making Sunday morning pancakes, recipes that use cake flour and self-rising flour are less common. So unless you bake a lot, you might not have cake flour and self-rising flour ready in your pantry. Rather than run into town to pick up a bag at the last minute, you can substitute all-purpose flour (a.k.a. AP flour) for these varieties at home, using a few additional ingredients that you likely already have on hand. Yup, we just saved you a trip to the grocery store, all in the name of a moist, tender slice of chocolate cake (win-win)."
    },
    {
       "id": 9,
       "title": "23 Acorn Squash Recipes We’re Squirreling Away for Fall and Winter",
       "img": "https://assets.epicurious.com/photos/5ba010d0fe44ba546264204b/16:9/w_1920%2Cc_limit/Sheet-Pan-Roasted-Squash-and-Feta-Salad-13092018.jpg",
       "category": "RECIPE ROUNDUP",
       "author": "MEREDITH STETTNER AND THE EDITORS OF EPICURIOUS",
       "date": "10.07.22",
       "innerSubTitle": "Our best recipes for acorn squash include slow-roasted vegetable salads, quick weeknight dinner ideas, and a creamy custard pie.",
       "description": "Acorn squash is an adaptable ingredient, equally at home in a weekday salad or dinner party–worthy entrée. Our favorite acorn squash recipes highlight that versatility, proving that autumnal cooking doesn’t have to involve sugared cranberries, brown butter, or pumpkin spice to feel thoroughly seasonal—although using any of those ingredients sure wouldn’t hurt.\nWant something rich and warming that could double as dessert? Cook acorn squash halves with maple syrup until rich and buttery, à la Ina Garten. Or, if you crave a wholesome autumnal supper, try acorn squash stuffed with wild rice, kale, and other hearty fall fare.\nWhether you’re looking for a side dish for an upcoming holiday, an easy weeknight supper, or a seasonal dinner party main, there’s an acorn squash recipe to fit the bill below."
    },
    {
       "id": 10,
       "title": "37 Spinach Recipes That’ll Make All Your Other Veggies Green With Envy",
       "img": "https://assets.epicurious.com/photos/620fc40be02a52d109bfd087/16:9/w_1920%2Cc_limit/Gozleme_RECIPE_021622_28809.jpg",
       "category": "RECIPE ROUNDUP",
       "author": "MEREDITH STETTNER AND THE EDITORS OF EPICURIOUS",
       "date": "09.29.22",
       "innerSubTitle": "The nutrient-dense green is packed with calcium, potassium, vitamin C, and dietary fiber. It’s also extremely delicious.",
       "description": "This bounty of great spinach recipes should come in handy as the seasons change: A butternut squash and creamed spinach gratin delivers autumnal elegance, while spinach-and-sausage lasagna promises to warm you up in winter. When berries arrive at your local farmers market, toss them with fresh spinach and kefir vinaigrette in what may just be the world’s most perfect summer salad. And a simple sautéed spinach recipe makes for an easy and quick side dish to serve year-round. The versatile vegetable is a team player that’s equally at home in crisp salads, creamy dips, fresh pastas, and dumpling doughs. Whether you’re working with mature or baby spinach leaves, you can create all manner of meals from these leafy greens. No matter your craving, our favorite recipes for raw and cooked spinach have you covered."
    },
    {
       "id": 11,
       "title": "Who Invented Mac and Cheese? This American Favorite Has Ancient Roman Roots",
       "img": "https://assets.epicurious.com/photos/630ce464d3f76b9158811983/16:9/w_1920,c_limit/OurFavoriteMacaroniCheese_HERO_082522_38932.jpg",
       "category": "HISTORY",
       "author": "KARIMA MOYER-NOCCHI AND ADRIAN MILLER",
       "date": "09.27.22",
       "innerSubTitle": "A look at the historical fallacies, truths, and wishful thinking about the queen of comfort foods.",
       "description": "You’re making up a macaroni and cheese casserole for the neighborhood potluck. As you stir, the plump elbows surrender to the thick, creamy orange cheese sauce. The voluptuous, squishy sound of walking barefoot through mud promises success. A top layer of grated cheese, browned to a golden crust, will add the final irresistible allure to this quintessentially American dish. But how did a combination of cheese and pasta—two European cultural exports—become one of America’s best-known staples? \n The most famous version of the story goes like this: Thomas Jefferson brought an enslaved James Hemings to France to study culinary arts. Jefferson not only financed the lavish crash course in gastronomy but smuggled a pasta machine back from Naples so that Hemings could introduce macaroni and cheese to the elite families of the American South. Often, Hemings is left out of the story completely and Jefferson alone is the protagonist. A Budweiser ad from 1948 shows an illustration of Jefferson himself, serving plates of freshly made pasta to fellow forefathers. But that tidy origin story is just an example of a gastromyth—a food-related tall tale that snowballed as it’s been told to new generations. When it comes to macaroni and cheese history, we’ve got a lot more unpacking to do."
    }
 ]
 