[
   {
      "id": 31,
      "title": "Holiday Gifts for Cooks and Food Lovers",
      "img": "https://assets.epicurious.com/photos/63877c8ed6dcac4735e54867/16:9/w_1920,c_limit/GiftGuide2022_HERO_113022_42923.jpg",
      "category": "SHOPPING",
      "author": "EMILY JOHNSON AND THE EDITORS OF EPICURIOUS",
      "date": "December 13, 2022",
      "innerSubTitle": "Our hub for holiday gift inspiration, with ideas for every lucky recipient on your list.",
      "description": "At first, buying a holiday gift for someone who loves to cook and eat seems easy: Killer cookware, something delicious to eat, or a lifesaving kitchen tool all jump out as obvious choices. But as soon as you start to think specifically about the person you're shopping for, you’ll probably realize it’s more complicated. Serious cooks often have every piece of cookware they need; so you’ll need a gift for people who already own top-notch skillets and Dutch ovens, and we’ve got that. We’ve got gifts for people who like growing their produce as much as they like sautéing it with butter and herbs. We’ve got gifts for people whose hot sauce collection takes up more space than their fridge door can handle. We’ve got gifts for people whose whole personality is the cheese board they bring to the party. And ideas for people who just want to cozy up next to a fire all winter long. We’ve also thought about the gifting situations you’re likely to find yourself in, whether that’s a multigenerational family get together or a holiday party where you barely know the host. We got specific in our gift guides this year, because we know you don’t want to go down as that person who gave generic junk. Find the full list of curated gift ideas for everyone on your list below."
   },
   {
      "id": 32,
      "title": "41 Foolproof Gifts for People You Don't Really Know",
      "img": "https://assets.epicurious.com/photos/636ea6c448052e7ad54155a9/16:9/w_1920,c_limit/artifaqt-design-asparagus-beeswax-taper-candles_HERO_110922_12421_V1_final.jpg",
      "category": "GIFT GUIDE",
      "author": "WILDER DAVIES",
      "date": "December 6, 2022",
      "innerSubTitle": "Never get caught giving that lame candle again.",
      "description": "Let’s face an age-old problem head on here: There are times where we feel compelled, or are obligated by social conditions, to buy gifts for acquaintances we don’t know very well. And we may simply…not care enough to try very hard. Sure, you can, in the words of this perennially relevant SNL skit, “go into your closet just to see what crap is in there,” excavating a crappy candle to offload on a poor unsuspecting victim before calling it a day. But the truth is, the act of gift giving is really about you, the gift giver, more than it's about the gift receiver's material gain. The gift you give is a demonstration of your capacity for thoughtfulness and a measurement of your taste. If you give a crappy candle, you risk a crappy reputation. And this holiday season we should all be concerned with our own reputations first and foremost.\nGiven the high-stakes social politics of “gifts for acquaintances” this time of year, it's no wonder people suffer from analysis paralysis and throw in the towel, dubbing themselves “bad gift givers.” Luckily, I'm here to help you escape that fate. In my opinion, a bad gift giver is merely an unprepared gift giver. So let’s get you prepared. \nBelow you'll find a list of foolproof gifts for people you don't know super well—your coworkers, your boyfriend's mom's friend who randomly showed up at your holiday dinner, your sister's new girlfriend who you don't think will be in the picture very long but who your mom begged you to make feel welcome, and so on.  You'll notice there's an emphasis on food and food-related items, because, well, we are a food website. But also, here's a great point: Everybody eats, which makes food perfect for cordial and not-so-intimate gifts. Don't worry, though, you won't find any tacky fruit baskets or edible arrangements in sight. "
   },
   {
      "id": 33,
      "title": "35 Gifts for Gardeners That Are Actually Good",
      "img": "https://assets.epicurious.com/photos/62558f86152bb297244ffa23/16:9/w_1920,c_limit/best-gardening-gloves_HERO_041122_6778_VOG_NocBadge_final.jpg",
      "category": "GIFT GUIDE",
      "author": "WILDER DAVIES",
      "date": "October 31, 2022",
      "innerSubTitle": "Practical-yet-niche tools, beautifully designed attire for mucking about outside, and things they wouldn't think to buy themselves. ",
      "description": "You might be looking for the best gifts for gardeners for this first time this year, because in today's world, there are a lot more people who love to garden. Like many activities that don't require leaving the house, gardening has seen a boom in popularity the past couple of years for reasons I don't need to mention. Personally, I love to garden so much that I have tricked my workplace into letting me write about it regularly, even though this is a food website. And all this extra time spent at home has only served to intensify my passion for gardening, leaving me destined to spend all winter daydreaming about next year's growing season. If you have a loved one who happens to also be a dedicated gardener, chances are they're also likely resting on the windowsill in somber repose, waiting for spring to come. All the more reason to give them a gift they can look forward to using once the time comes to get back out into the yard.\nHere's the thing though: If you yourself aren't an owner of a green thumb, there's a good chance the most obvious gift ideas that come to mind won't be what a gardener needs.  Your beloved plant lover probably wont be too enthused over a grow kit for an indoor herb garden, a tote that says 'I <3 Succulents', or a glass terrarium.  You can do much better than that. \nI compiled this list of the best gifts for gardeners, including practical-yet-niche tools, beautifully designed attire for mucking about outside, and things they wouldn't think to buy themselves. If you don't know much about gardening, don't worry; put down the bird feeder (a.k.a. squirrel magnet) and I'll help you out. Read on for all the best gifts for gardeners."
   },
   {
      "id": 34,
      "title": "21 Gifts for Minimalists That Won’t End Up in the Donate Pile",
      "img": "https://assets.epicurious.com/photos/63692e480b9719125777cbbe/16:9/w_1920,c_limit/brightland-the-artist-capsule_HERO_110122_12257_VOG_final.jpg",
      "category": "SHOPPING",
      "author": "EMILY FARRIS",
      "date": "December 7, 2022",
      "innerSubTitle": "Even the pickiest person will appreciate specialty condiments, gorgeous taper candles, or a versatile grocery tote.",
      "description": "From a purely logical standpoint, the best gift for a minimalist is no gift at all. That’s because the folks who are truly dedicated to a minimal lifestyle have carefully curated their belongings, keeping only what they need, as well as a few items they really, really love. It’s why their homes always seem so tidy and why they can pull off those gorgeous open cabinets in the kitchen even if they cook a lot.\nMinimalists generally also put a lot of thought into what makes it into their homes, and something that may seem beautiful and useful to you might actually stress them out—especially if they worry getting rid of it might hurt your feelings. Combine all of that with the fact that many also happen to be intimidatingly stylish people, and the thought of finding the perfect gift for a minimalist can start to feel like a lost cause. \nBut let’s be real: giving nothing is no fun for anybody. And while cash and gift cards are always useful, they’re not exactly fun to give or receive either. So before you throw your hands up in the air (or default to yet another boring gift card) check out this list of the best gifts for minimalists. Most of the items happen to be our specialty here at Epi—edible goods that won’t stay in the kitchen long. I’ve also thrown in a handful of other consumables for the home that don’t last forever, like flowers and candles, as well as a small selection of high-quality items that aren’t going to end up in the “donate” pile. "
   }
]
